// Какое будет выведено значение: let x = 5; alert( x++ ); ?
// let x = 5;
// alert( x++ );
// Ответ: 5

// Чему равно такое выражение: [ ] + false - null + true ?
// console.log('[ ] + false - null + true: ', [ ] + false - null + true);
// Ответ: NaN

// Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// let y = 1;
// let x = y = 2;
// alert(x);
// Ответ: 2

// Чему равна сумма [ ] + 1 + 2?
// console.log('[ ] + 1 + 2: ', [ ] + 1 + 2);
// Ответ: 12

// Что выведет этот код: alert( "1"[0] )?
// alert( "1"[0] );
// Ответ: 1

// Чему равно 2 && 1 && null && 0 && undefined ?
// console.log('2 && 1 && null && 0 && undefined: ', 2 && 1 && null && 0 && undefined);
// Ответ: null

// Есть ли разница между выражениями? !!( a && b ) и (a && b)?
// a = 7;
// b = 3;
// console.log('(a && b): ', (a && b));
// console.log('!!(a && b): ', !!(a && b));
// Ответ: разница между выражениями заключается в типе возвращаемого значения.
// Т.е. разница есть, т.к. оператор '!!' используется для явного приведения операнда к логическому типу

// Что выведет этот код: alert( null || 2 && 3 || 4 ); ?
// alert( null || 2 && 3 || 4 );
// Ответ: 3

// a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?
// a = [1, 2, 3];
// b = [1, 2, 3];
// if ( a == b ) console.log('a == b - Правда');
// else console.log('a == b - Неправда');
// Ответ: Неправда

// Что выведет этот код: alert( +"Infinity" ); ?
// alert( +"Infinity" );
// Ответ: Infinity

// Верно ли сравнение: "ёжик" > "яблоко"?
// if ( "ёжик" > "яблоко" ) console.log(' Верно, что "ёжик" > "яблоко" ');
// else console.log(' Неверно, что "ёжик" > "яблоко" ');
// Ответ: Верно


// Чему равно 0 || "" || 2 || undefined || true || falsе ?
// console.log('0 || "" || 2 || undefined || true || falsе: ', 0 || "" || 2 || undefined || true || falsе);
// Ответ: 2